## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 14 to add, 3 to change, 3 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_iam_policy.parameters_csi`                           |
|        | `aws_iam_role.secrets_csi_blazer`                         |
|        | `aws_iam_role.secrets_csi_nginx`                          |
|        | `aws_iam_role_policy_attachment.parameters_csi_blazer`    |
|        | `aws_iam_role_policy_attachment.parameters_csi_nginx`     |
|        | `aws_iam_role_policy_attachment.secrets_csi_blazer`       |
|        | `aws_iam_role_policy_attachment.secrets_csi_nginx`        |
|        | `aws_lb_listener.internal_alb-80`                         |
|        | `aws_route53_record.notification_internal_dns`            |
|        | `aws_route53_record.wildcard_CNAME`                       |
|        | `aws_security_group_rule.database-tools-internal-egress`  |
|        | `aws_security_group_rule.database-tools-internal-ingress` |
|        | `aws_security_group_rule.internal_alb_http_egress`        |
|        | `aws_security_group_rule.internal_alb_http_ingress`       |
| delete | `aws_iam_role.secrets_csi`                                |
|        | `aws_iam_role_policy_attachment.secrets_csi`              |
|        | `aws_iam_role_policy_attachment.worker_csi`               |
| update | `aws_eks_addon.coredns`                                   |
|        | `aws_eks_addon.ebs_driver`                                |
|        | `aws_eks_addon.kube_proxy`                                |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_eks_addon.coredns will be updated in-place
  ~ resource "aws_eks_addon" "coredns" {
      + configuration_values        = jsonencode(
            {
              + corefile     = <<-EOT
                    .:53 {
                        log
                        errors
                        health {
                            lameduck 5s
                          }
                        ready
                        kubernetes cluster.local in-addr.arpa ip6.arpa {
                          pods insecure
                          fallthrough in-addr.arpa ip6.arpa
                        }
                        prometheus :9153
                        forward . /etc/resolv.conf
                        cache 60
                        loop
                        reload
                        loadbalance
                    }
                EOT
              + nodeSelector = {
                  + "eks.amazonaws.com/capacityType" = "ON_DEMAND"
                }
            }
        )
        id                          = "notification-canada-ca-production-eks-cluster:coredns"
        tags                        = {}
        # (9 unchanged attributes hidden)
    }

  # aws_eks_addon.ebs_driver will be updated in-place
  ~ resource "aws_eks_addon" "ebs_driver" {
      ~ addon_version               = "v1.26.1-eksbuild.1" -> "v1.27.0-eksbuild.1"
        id                          = "notification-canada-ca-production-eks-cluster:aws-ebs-csi-driver"
        tags                        = {}
        # (8 unchanged attributes hidden)
    }

  # aws_eks_addon.kube_proxy will be updated in-place
  ~ resource "aws_eks_addon" "kube_proxy" {
      ~ addon_version               = "v1.29.0-eksbuild.1" -> "v1.29.0-eksbuild.3"
        id                          = "notification-canada-ca-production-eks-cluster:kube-proxy"
        tags                        = {}
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.parameters_csi will be created
  + resource "aws_iam_policy" "parameters_csi" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "parameters-csi-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:Describe*",
                          + "ssm:Get*",
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                          + "ssm:GetParametersByPath",
                          + "ssm:List*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:296255494825:parameter*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_iam_role.secrets_csi will be destroyed
  # (because aws_iam_role.secrets_csi is not in configuration)
  - resource "aws_iam_role" "secrets_csi" {
      - arn                   = "arn:aws:iam::296255494825:role/secrets-csi-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              - "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:nginx:ingress-nginx-ingress"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2024-02-06T16:50:17Z" -> null
      - force_detach_policies = false -> null
      - id                    = "secrets-csi-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::296255494825:policy/secrets-csi-policy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "secrets-csi-role" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {} -> null
      - unique_id             = "AROAUJ6RUDKURXUO3LQV7" -> null
    }

  # aws_iam_role.secrets_csi_blazer will be created
  + resource "aws_iam_role" "secrets_csi_blazer" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:tools:blazer"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "secrets-csi-role-blazer"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.secrets_csi_nginx will be created
  + resource "aws_iam_role" "secrets_csi_nginx" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:nginx:ingress-nginx-ingress"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "secrets-csi-role-nginx"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.parameters_csi_blazer will be created
  + resource "aws_iam_role_policy_attachment" "parameters_csi_blazer" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "secrets-csi-role-blazer"
    }

  # aws_iam_role_policy_attachment.parameters_csi_nginx will be created
  + resource "aws_iam_role_policy_attachment" "parameters_csi_nginx" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "secrets-csi-role-nginx"
    }

  # aws_iam_role_policy_attachment.secrets_csi will be destroyed
  # (because aws_iam_role_policy_attachment.secrets_csi is not in configuration)
  - resource "aws_iam_role_policy_attachment" "secrets_csi" {
      - id         = "secrets-csi-role-20240206165017193700000003" -> null
      - policy_arn = "arn:aws:iam::296255494825:policy/secrets-csi-policy" -> null
      - role       = "secrets-csi-role" -> null
    }

  # aws_iam_role_policy_attachment.secrets_csi_blazer will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi_blazer" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/secrets-csi-policy"
      + role       = "secrets-csi-role-blazer"
    }

  # aws_iam_role_policy_attachment.secrets_csi_nginx will be created
  + resource "aws_iam_role_policy_attachment" "secrets_csi_nginx" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::296255494825:policy/secrets-csi-policy"
      + role       = "secrets-csi-role-nginx"
    }

  # aws_iam_role_policy_attachment.worker_csi will be destroyed
  # (because aws_iam_role_policy_attachment.worker_csi is not in configuration)
  - resource "aws_iam_role_policy_attachment" "worker_csi" {
      - id         = "eks-worker-role-20240206165017163000000002" -> null
      - policy_arn = "arn:aws:iam::296255494825:policy/secrets-csi-policy" -> null
      - role       = "eks-worker-role" -> null
    }

  # aws_lb_listener.internal_alb-80 will be created
  + resource "aws_lb_listener" "internal_alb-80" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ca-central-1:296255494825:loadbalancer/app/notify-production-internal-alb/c9882e7f9cbe665c"
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # aws_route53_record.notification_internal_dns will be created
  + resource "aws_route53_record" "notification_internal_dns" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "production.notification.internal.com"
      + type            = "A"
      + zone_id         = "Z04039242WVL6VNQ7FX6A"

      + alias {
          + evaluate_target_health = true
          + name                   = "internal-notify-production-internal-alb-1666342248.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.wildcard_CNAME will be created
  + resource "aws_route53_record" "wildcard_CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.production.notification.internal.com"
      + records         = [
          + "production.notification.internal.com",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z04039242WVL6VNQ7FX6A"
    }

  # aws_security_group_rule.database-tools-internal-egress will be created
  + resource "aws_security_group_rule" "database-tools-internal-egress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow Internal access to blazer DB"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0eac71b27829f15ef"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "egress"
    }

  # aws_security_group_rule.database-tools-internal-ingress will be created
  + resource "aws_security_group_rule" "database-tools-internal-ingress" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Allow Internal access to blazer DB"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0eac71b27829f15ef"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 5432
      + type                     = "ingress"
    }

  # aws_security_group_rule.internal_alb_http_egress will be created
  + resource "aws_security_group_rule" "internal_alb_http_egress" {
      + description              = "Internal ALB HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-09e3175f46bc85607"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0c3927bbc4d68fb0b"
      + to_port                  = 80
      + type                     = "egress"
    }

  # aws_security_group_rule.internal_alb_http_ingress will be created
  + resource "aws_security_group_rule" "internal_alb_http_ingress" {
      + description              = "Internal ALB HTTP"
      + from_port                = 80
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-09e3175f46bc85607"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0c3927bbc4d68fb0b"
      + to_port                  = 80
      + type                     = "ingress"
    }

Plan: 14 to add, 3 to change, 3 to destroy.

Changes to Outputs:
  - eks_csi_role_arn                       = "arn:aws:iam::296255494825:role/secrets-csi-role" -> null

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.internal_alb_tls"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.internal_nginx_http"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.aggregating-queues-not-active-1-minute-warning[0]"]
WARN -...
```

</details>
